#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.subnet.google_compute_subnetwork.subnetwork["l7-us-central1-allex-vpc-2-proxy-only"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "192.168.128.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "l7-us-central1-allex-vpc-2-proxy-only"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "jithin-terraform-allex-test122"
      + purpose                    = "REGIONAL_MANAGED_PROXY"
      + region                     = "us-central1"
      + role                       = "ACTIVE"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.subnet.google_compute_subnetwork.subnetwork["us-central1-allex-vpc-2-sb-01"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.255.252.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "us-central1-allex-vpc-2-sb-01"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "jithin-terraform-allex-test122"
      + purpose                    = "PRIVATE"
      + region                     = "us-central1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.subnet.google_compute_subnetwork.subnetwork["us-central1-allex-vpc-2-sb-02"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.255.251.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "us-central1-allex-vpc-2-sb-02"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "jithin-terraform-allex-test122"
      + purpose                    = "PRIVATE"
      + region                     = "us-central1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.vpc.google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + description                               = "VPC  us-central1-allex-vpc-02 created in jithin-terraform-allex-test122"
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "us-central1-allex-vpc-02"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + project                                   = "jithin-terraform-allex-test122"
      + routing_mode                              = "REGIONAL"
      + self_link                                 = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jithinpnjm, Action: `pull_request`, Working Directory: ``, Workflow: `gcp_bootstrap_vpc2`*